app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
<%= simple_form_for @article do |f|  %>
  <%= f.collection_select :category_id, Category.all, :id, :name, {promp: "Choose a Category"} %>