app/controllers/articles_controller.rb

  def index
    if params[:category].blank?
      @articles = Article.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles = Article.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Art"]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]

  def create
  	@article = current_user.articles.build(article_params)
  	if @article.save
---
INSERT INTO "articles" ("title", "content", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Third"], ["content", "asasasasas"], ["category_id", 2], ["user_id", 1], ["created_at", "2015-12-24 14:39:27.817844"], ["updated_at", "2015-12-24 14:39:27.817844"]]